; domain
(define (domain blocksworld-4ops)
  (:requirements :strips)
  (:predicates
    (clear ?x)
    (on-table ?x)
    (arm-empty)
    (holding ?x)
    (on ?x ?y)
  )

  (:action pickup
    :parameters (?ob)
    :precondition (and (clear ?ob) (on-table ?ob) (arm-empty))
    :effect (and (holding ?ob) (not (clear ?ob)) (not (on-table ?ob))
      (not (arm-empty)))
  )

  (:action putdown
    :parameters (?ob)
    :precondition (holding ?ob)
    :effect (and (clear ?ob) (arm-empty) (on-table ?ob)
      (not (holding ?ob)))
  )

  (:action stack
    :parameters (?ob ?underob)
    :precondition (and (clear ?underob) (holding ?ob))
    :effect (and (arm-empty) (clear ?ob) (on ?ob ?underob)
      (not (clear ?underob)) (not (holding ?ob)))
  )

  (:action unstack
    :parameters (?ob ?underob)
    :precondition (and (on ?ob ?underob) (clear ?ob) (arm-empty))
    :effect (and (holding ?ob) (clear ?underob)
      (not (on ?ob ?underob)) (not (clear ?ob)) (not (arm-empty)))
  )
)

; problem
(define (problem BW-rand-31)
(:domain blocksworld-4ops)
(:objects b1 b2 b3 b4 b5 b6 b7 b8 b9 b10 b11 b12 b13 b14 b15 b16 b17 b18 b19 b20 b21 b22 b23 b24 b25 b26 b27 b28 b29 b30 b31 )
(:init
(arm-empty)
(on b1 b13)
(on b2 b16)
(on b3 b10)
(on-table b4)
(on b5 b4)
(on b6 b3)
(on b7 b30)
(on b8 b5)
(on b9 b18)
(on b10 b23)
(on b11 b19)
(on-table b12)
(on b13 b20)
(on b14 b11)
(on b15 b2)
(on b16 b17)
(on b17 b6)
(on b18 b25)
(on b19 b7)
(on b20 b29)
(on b21 b26)
(on b22 b28)
(on b23 b24)
(on b24 b31)
(on b25 b15)
(on b26 b1)
(on b27 b12)
(on b28 b21)
(on b29 b14)
(on-table b30)
(on b31 b27)
(clear b8)
(clear b9)
(clear b22)
)
(:goal
(and
(on b1 b16)
(on b2 b13)
(on b3 b1)
(on b4 b15)
(on b5 b14)
(on b6 b9)
(on b7 b27)
(on b8 b20)
(on b9 b18)
(on b11 b19)
(on b12 b29)
(on b13 b17)
(on b14 b12)
(on b15 b11)
(on b16 b22)
(on b17 b7)
(on b19 b8)
(on b20 b24)
(on b22 b2)
(on b24 b26)
(on b25 b4)
(on b26 b28)
(on b27 b21)
(on b29 b25))
)
)

; plan
1. (unstack b8 b5)
   deleted: (on b8 b5) (clear b8) (arm-empty)
   added: (holding b8) (clear b5)
   goals met: 2 of 24
2. (putdown b8)
   deleted: (holding b8)
   added: (clear b8) (arm-empty) (on-table b8)
   goals met: 2 of 24
3. (unstack b5 b4)
   deleted: (on b5 b4) (clear b5) (arm-empty)
   added: (holding b5) (clear b4)
   goals met: 2 of 24
4. (putdown b5)
   deleted: (holding b5)
   added: (clear b5) (arm-empty) (on-table b5)
   goals met: 2 of 24
5. (unstack b9 b18)
   deleted: (on b9 b18) (clear b9) (arm-empty)
   added: (holding b9) (clear b18)
   goals met: 1 of 24
6. (putdown b9)
   deleted: (holding b9)
   added: (clear b9) (arm-empty) (on-table b9)
   goals met: 1 of 24
7. (unstack b18 b25)
   deleted: (on b18 b25) (clear b18) (arm-empty)
   added: (holding b18) (clear b25)
   goals met: 1 of 24
8. (putdown b18)
   deleted: (holding b18)
   added: (clear b18) (arm-empty) (on-table b18)
   goals met: 1 of 24
9. (unstack b25 b15)
   deleted: (on b25 b15) (clear b25) (arm-empty)
   added: (holding b25) (clear b15)
   goals met: 1 of 24
10. (putdown b25)
   deleted: (holding b25)
   added: (clear b25) (arm-empty) (on-table b25)
   goals met: 1 of 24
11. (unstack b15 b2)
   deleted: (on b15 b2) (clear b15) (arm-empty)
   added: (holding b15) (clear b2)
   goals met: 1 of 24
12. (putdown b15)
   deleted: (holding b15)
   added: (clear b15) (arm-empty) (on-table b15)
   goals met: 1 of 24
13. (unstack b2 b16)
   deleted: (on b2 b16) (clear b2) (arm-empty)
   added: (holding b2) (clear b16)
   goals met: 1 of 24
14. (putdown b2)
   deleted: (holding b2)
   added: (clear b2) (arm-empty) (on-table b2)
   goals met: 1 of 24
15. (unstack b16 b17)
   deleted: (on b16 b17) (clear b16) (arm-empty)
   added: (holding b16) (clear b17)
   goals met: 1 of 24
16. (putdown b16)
   deleted: (holding b16)
   added: (clear b16) (arm-empty) (on-table b16)
   goals met: 1 of 24
17. (unstack b17 b6)
   deleted: (on b17 b6) (clear b17) (arm-empty)
   added: (holding b17) (clear b6)
   goals met: 1 of 24
18. (putdown b17)
   deleted: (holding b17)
   added: (clear b17) (arm-empty) (on-table b17)
   goals met: 1 of 24
19. (unstack b6 b3)
   deleted: (on b6 b3) (clear b6) (arm-empty)
   added: (holding b6) (clear b3)
   goals met: 1 of 24
20. (putdown b6)
   deleted: (holding b6)
   added: (clear b6) (arm-empty) (on-table b6)
   goals met: 1 of 24
21. (unstack b3 b10)
   deleted: (on b3 b10) (clear b3) (arm-empty)
   added: (holding b3) (clear b10)
   goals met: 1 of 24
22. (putdown b3)
   deleted: (holding b3)
   added: (clear b3) (arm-empty) (on-table b3)
   goals met: 1 of 24
23. (unstack b10 b23)
   deleted: (on b10 b23) (clear b10) (arm-empty)
   added: (holding b10) (clear b23)
   goals met: 1 of 24
24. (putdown b10)
   deleted: (holding b10)
   added: (clear b10) (arm-empty) (on-table b10)
   goals met: 1 of 24
25. (unstack b23 b24)
   deleted: (on b23 b24) (clear b23) (arm-empty)
   added: (holding b23) (clear b24)
   goals met: 1 of 24
26. (putdown b23)
   deleted: (holding b23)
   added: (clear b23) (arm-empty) (on-table b23)
   goals met: 1 of 24
27. (unstack b24 b31)
   deleted: (on b24 b31) (clear b24) (arm-empty)
   added: (holding b24) (clear b31)
   goals met: 1 of 24
28. (putdown b24)
   deleted: (holding b24)
   added: (clear b24) (arm-empty) (on-table b24)
   goals met: 1 of 24
29. (unstack b31 b27)
   deleted: (on b31 b27) (clear b31) (arm-empty)
   added: (holding b31) (clear b27)
   goals met: 1 of 24
30. (putdown b31)
   deleted: (holding b31)
   added: (clear b31) (arm-empty) (on-table b31)
   goals met: 1 of 24
31. (unstack b27 b12)
   deleted: (on b27 b12) (clear b27) (arm-empty)
   added: (holding b27) (clear b12)
   goals met: 1 of 24
32. (putdown b27)
   deleted: (holding b27)
   added: (clear b27) (arm-empty) (on-table b27)
   goals met: 1 of 24
33. (unstack b22 b28)
   deleted: (on b22 b28) (clear b22) (arm-empty)
   added: (holding b22) (clear b28)
   goals met: 1 of 24
34. (putdown b22)
   deleted: (holding b22)
   added: (clear b22) (arm-empty) (on-table b22)
   goals met: 1 of 24
35. (unstack b28 b21)
   deleted: (on b28 b21) (clear b28) (arm-empty)
   added: (holding b28) (clear b21)
   goals met: 1 of 24
36. (putdown b28)
   deleted: (holding b28)
   added: (clear b28) (arm-empty) (on-table b28)
   goals met: 1 of 24
37. (unstack b21 b26)
   deleted: (on b21 b26) (clear b21) (arm-empty)
   added: (holding b21) (clear b26)
   goals met: 1 of 24
38. (putdown b21)
   deleted: (holding b21)
   added: (clear b21) (arm-empty) (on-table b21)
   goals met: 1 of 24
39. (unstack b26 b1)
   deleted: (on b26 b1) (clear b26) (arm-empty)
   added: (holding b26) (clear b1)
   goals met: 1 of 24
40. (putdown b26)
   deleted: (holding b26)
   added: (clear b26) (arm-empty) (on-table b26)
   goals met: 1 of 24
41. (unstack b1 b13)
   deleted: (on b1 b13) (clear b1) (arm-empty)
   added: (holding b1) (clear b13)
   goals met: 1 of 24
42. (putdown b1)
   deleted: (holding b1)
   added: (clear b1) (arm-empty) (on-table b1)
   goals met: 1 of 24
43. (unstack b13 b20)
   deleted: (on b13 b20) (clear b13) (arm-empty)
   added: (holding b13) (clear b20)
   goals met: 1 of 24
44. (putdown b13)
   deleted: (holding b13)
   added: (clear b13) (arm-empty) (on-table b13)
   goals met: 1 of 24
45. (unstack b20 b29)
   deleted: (on b20 b29) (clear b20) (arm-empty)
   added: (holding b20) (clear b29)
   goals met: 1 of 24
46. (putdown b20)
   deleted: (holding b20)
   added: (clear b20) (arm-empty) (on-table b20)
   goals met: 1 of 24
47. (unstack b29 b14)
   deleted: (on b29 b14) (clear b29) (arm-empty)
   added: (holding b29) (clear b14)
   goals met: 1 of 24
48. (putdown b29)
   deleted: (holding b29)
   added: (clear b29) (arm-empty) (on-table b29)
   goals met: 1 of 24
49. (unstack b14 b11)
   deleted: (on b14 b11) (clear b14) (arm-empty)
   added: (holding b14) (clear b11)
   goals met: 1 of 24
50. (putdown b14)
   deleted: (holding b14)
   added: (clear b14) (arm-empty) (on-table b14)
   goals met: 1 of 24
51. (unstack b11 b19)
   deleted: (on b11 b19) (clear b11) (arm-empty)
   added: (holding b11) (clear b19)
   goals met: 0 of 24
52. (putdown b11)
   deleted: (holding b11)
   added: (clear b11) (arm-empty) (on-table b11)
   goals met: 0 of 24
53. (unstack b19 b7)
   deleted: (on b19 b7) (clear b19) (arm-empty)
   added: (holding b19) (clear b7)
   goals met: 0 of 24
54. (putdown b19)
   deleted: (holding b19)
   added: (clear b19) (arm-empty) (on-table b19)
   goals met: 0 of 24
55. (unstack b7 b30)
   deleted: (on b7 b30) (clear b7) (arm-empty)
   added: (holding b7) (clear b30)
   goals met: 0 of 24
56. (putdown b7)
   deleted: (holding b7)
   added: (clear b7) (arm-empty) (on-table b7)
   goals met: 0 of 24
57. (pickup b26)
   deleted: (clear b26) (on-table b26) (arm-empty)
   added: (holding b26)
   goals met: 0 of 24
58. (stack b26 b28)
   deleted: (clear b28) (holding b26)
   added: (arm-empty) (clear b26) (on b26 b28)
   goals met: 1 of 24
59. (pickup b24)
   deleted: (clear b24) (on-table b24) (arm-empty)
   added: (holding b24)
   goals met: 1 of 24
60. (stack b24 b26)
   deleted: (clear b26) (holding b24)
   added: (arm-empty) (clear b24) (on b24 b26)
   goals met: 2 of 24
61. (pickup b20)
   deleted: (clear b20) (on-table b20) (arm-empty)
   added: (holding b20)
   goals met: 2 of 24
62. (stack b20 b24)
   deleted: (clear b24) (holding b20)
   added: (arm-empty) (clear b20) (on b20 b24)
   goals met: 3 of 24
63. (pickup b8)
   deleted: (clear b8) (on-table b8) (arm-empty)
   added: (holding b8)
   goals met: 3 of 24
64. (stack b8 b20)
   deleted: (clear b20) (holding b8)
   added: (arm-empty) (clear b8) (on b8 b20)
   goals met: 4 of 24
65. (pickup b19)
   deleted: (clear b19) (on-table b19) (arm-empty)
   added: (holding b19)
   goals met: 4 of 24
66. (stack b19 b8)
   deleted: (clear b8) (holding b19)
   added: (arm-empty) (clear b19) (on b19 b8)
   goals met: 5 of 24
67. (pickup b11)
   deleted: (clear b11) (on-table b11) (arm-empty)
   added: (holding b11)
   goals met: 5 of 24
68. (stack b11 b19)
   deleted: (clear b19) (holding b11)
   added: (arm-empty) (clear b11) (on b11 b19)
   goals met: 6 of 24
69. (pickup b15)
   deleted: (clear b15) (on-table b15) (arm-empty)
   added: (holding b15)
   goals met: 6 of 24
70. (stack b15 b11)
   deleted: (clear b11) (holding b15)
   added: (arm-empty) (clear b15) (on b15 b11)
   goals met: 7 of 24
71. (pickup b4)
   deleted: (clear b4) (on-table b4) (arm-empty)
   added: (holding b4)
   goals met: 7 of 24
72. (stack b4 b15)
   deleted: (clear b15) (holding b4)
   added: (arm-empty) (clear b4) (on b4 b15)
   goals met: 8 of 24
73. (pickup b25)
   deleted: (clear b25) (on-table b25) (arm-empty)
   added: (holding b25)
   goals met: 8 of 24
74. (stack b25 b4)
   deleted: (clear b4) (holding b25)
   added: (arm-empty) (clear b25) (on b25 b4)
   goals met: 9 of 24
75. (pickup b29)
   deleted: (clear b29) (on-table b29) (arm-empty)
   added: (holding b29)
   goals met: 9 of 24
76. (stack b29 b25)
   deleted: (clear b25) (holding b29)
   added: (arm-empty) (clear b29) (on b29 b25)
   goals met: 10 of 24
77. (pickup b12)
   deleted: (clear b12) (on-table b12) (arm-empty)
   added: (holding b12)
   goals met: 10 of 24
78. (stack b12 b29)
   deleted: (clear b29) (holding b12)
   added: (arm-empty) (clear b12) (on b12 b29)
   goals met: 11 of 24
79. (pickup b14)
   deleted: (clear b14) (on-table b14) (arm-empty)
   added: (holding b14)
   goals met: 11 of 24
80. (stack b14 b12)
   deleted: (clear b12) (holding b14)
   added: (arm-empty) (clear b14) (on b14 b12)
   goals met: 12 of 24
81. (pickup b5)
   deleted: (clear b5) (on-table b5) (arm-empty)
   added: (holding b5)
   goals met: 12 of 24
82. (stack b5 b14)
   deleted: (clear b14) (holding b5)
   added: (arm-empty) (clear b5) (on b5 b14)
   goals met: 13 of 24
83. (pickup b9)
   deleted: (clear b9) (on-table b9) (arm-empty)
   added: (holding b9)
   goals met: 13 of 24
84. (stack b9 b18)
   deleted: (clear b18) (holding b9)
   added: (arm-empty) (clear b9) (on b9 b18)
   goals met: 14 of 24
85. (pickup b6)
   deleted: (clear b6) (on-table b6) (arm-empty)
   added: (holding b6)
   goals met: 14 of 24
86. (stack b6 b9)
   deleted: (clear b9) (holding b6)
   added: (arm-empty) (clear b6) (on b6 b9)
   goals met: 15 of 24
87. (pickup b27)
   deleted: (clear b27) (on-table b27) (arm-empty)
   added: (holding b27)
   goals met: 15 of 24
88. (stack b27 b21)
   deleted: (clear b21) (holding b27)
   added: (arm-empty) (clear b27) (on b27 b21)
   goals met: 16 of 24
89. (pickup b7)
   deleted: (clear b7) (on-table b7) (arm-empty)
   added: (holding b7)
   goals met: 16 of 24
90. (stack b7 b27)
   deleted: (clear b27) (holding b7)
   added: (arm-empty) (clear b7) (on b7 b27)
   goals met: 17 of 24
91. (pickup b17)
   deleted: (clear b17) (on-table b17) (arm-empty)
   added: (holding b17)
   goals met: 17 of 24
92. (stack b17 b7)
   deleted: (clear b7) (holding b17)
   added: (arm-empty) (clear b17) (on b17 b7)
   goals met: 18 of 24
93. (pickup b13)
   deleted: (clear b13) (on-table b13) (arm-empty)
   added: (holding b13)
   goals met: 18 of 24
94. (stack b13 b17)
   deleted: (clear b17) (holding b13)
   added: (arm-empty) (clear b13) (on b13 b17)
   goals met: 19 of 24
95. (pickup b2)
   deleted: (clear b2) (on-table b2) (arm-empty)
   added: (holding b2)
   goals met: 19 of 24
96. (stack b2 b13)
   deleted: (clear b13) (holding b2)
   added: (arm-empty) (clear b2) (on b2 b13)
   goals met: 20 of 24
97. (pickup b22)
   deleted: (clear b22) (on-table b22) (arm-empty)
   added: (holding b22)
   goals met: 20 of 24
98. (stack b22 b2)
   deleted: (clear b2) (holding b22)
   added: (arm-empty) (clear b22) (on b22 b2)
   goals met: 21 of 24
99. (pickup b16)
   deleted: (clear b16) (on-table b16) (arm-empty)
   added: (holding b16)
   goals met: 21 of 24
100. (stack b16 b22)
   deleted: (clear b22) (holding b16)
   added: (arm-empty) (clear b16) (on b16 b22)
   goals met: 22 of 24
101. (pickup b1)
   deleted: (clear b1) (on-table b1) (arm-empty)
   added: (holding b1)
   goals met: 22 of 24
102. (stack b1 b16)
   deleted: (clear b16) (holding b1)
   added: (arm-empty) (clear b1) (on b1 b16)
   goals met: 23 of 24
103. (pickup b3)
   deleted: (clear b3) (on-table b3) (arm-empty)
   added: (holding b3)
   goals met: 23 of 24
104. (stack b3 b1)
   deleted: (clear b1) (holding b3)
   added: (arm-empty) (clear b3) (on b3 b1)
   goals met: 24 of 24
